{
    "id": "css",
    "name": "Curso intensivo de CSS3",
    "description": "Aprende a darle estilo y formato a tus p치ginas web, transformando estructuras planas en experiencias visuales atractivas 游꿛.",
    "modulos": [
        {
            "id": 1,
            "title": "Introducci칩n a CSS",
            "description": "Comprender치s qu칠 es CSS y c칩mo se aplica para dar estilo a las p치ginas web.",
            "lecciones": [
                {
                    "id": "a1",
                    "title": "쯈u칠 es CSS?",
                    "explicacion": "CSS (Cascading Style Sheets) es el lenguaje que permite aplicar estilos a los elementos HTML: colores, tama침os, tipograf칤as, m치rgenes y m치s. Separa el contenido (HTML) de la presentaci칩n, facilitando mantenimiento y escalabilidad."
                },
                {
                    "id": "a2",
                    "title": "C칩mo funciona CSS",
                    "explicacion": "CSS funciona aplicando reglas a selectores que apuntan a elementos HTML. Cada regla tiene un selector y un bloque de declaraciones: por ejemplo, `p { color: red; font-size: 16px; }`."
                },
                {
                    "id": "a3",
                    "title": "Formas de aplicar CSS",
                    "explicacion": "Hay tres formas principales: inline (directo en el HTML), internal (en la secci칩n `<style>` del HTML) y external (en un archivo `.css` separado vinculado con `<link>`). La recomendaci칩n profesional es usar external para mantener el c칩digo limpio y reutilizable."
                }
            ],
            "video": "",
            "dato": "CSS permite separar dise침o y contenido, facilitando la consistencia y mantenimiento de tu sitio."
        },
        {
            "id": 2,
            "title": "Selectores y propiedades b치sicas",
            "description": "Aprender치s a apuntar a los elementos correctos y aplicarles estilos fundamentales.",
            "lecciones": [
                {
                    "id": "b1",
                    "title": "Selectores b치sicos",
                    "explicacion": "Los selectores permiten elegir elementos HTML: `elemento` (p.ej., `p`), `.clase` (p.ej., `.btn`), `#id` (p.ej., `#menu`)."
                },
                {
                    "id": "b2",
                    "title": "Colores y fuentes",
                    "explicacion": "Con propiedades como `color`, `background-color` y `font-family` puedes cambiar la apariencia del texto y del fondo de cualquier elemento."
                },
                {
                    "id": "b3",
                    "title": "Margen, padding y border",
                    "explicacion": "Controlan el espacio alrededor de los elementos: `margin` para el exterior, `padding` para el interior, y `border` para los bordes visibles."
                }
            ],
            "video": "",
            "dato": "Comprender la caja de un elemento (box model) es fundamental para maquetar correctamente cualquier dise침o web."
        },
        {
            "id": 3,
            "title": "Dise침o y layout",
            "description": "Aprender치s a organizar elementos en la p치gina y crear estructuras complejas con CSS moderno.",
            "lecciones": [
                {
                    "id": "c1",
                    "title": "Display y posicionamiento",
                    "explicacion": "La propiedad `display` determina c칩mo se comporta un elemento (`block`, `inline`, `flex`, `grid`). `position` permite ubicar elementos de manera relativa, absoluta, fija o sticky."
                },
                {
                    "id": "c2",
                    "title": "Flexbox",
                    "explicacion": "Flexbox facilita distribuir espacio y alinear elementos en filas o columnas de forma flexible. Propiedades como `justify-content` y `align-items` son esenciales para layouts modernos."
                },
                {
                    "id": "c3",
                    "title": "CSS Grid",
                    "explicacion": "Grid es un sistema bidimensional para crear layouts complejos, dividiendo la p치gina en filas y columnas, asignando 치reas y posiciones precisas."
                }
            ],
            "video": "",
            "dato": "Flexbox y Grid son las herramientas m치s usadas hoy para maquetaci칩n web moderna, reemplazando antiguos hacks de floats y tablas."
        },
        {
            "id": 4,
            "title": "Animaciones y transiciones",
            "description": "Agregar movimiento y dinamismo a tu web para mejorar la experiencia del usuario.",
            "lecciones": [
                {
                    "id": "d1",
                    "title": "Transiciones",
                    "explicacion": "Permiten animar cambios de propiedades de forma suave, por ejemplo: `transition: all 0.3s ease;` al pasar el mouse sobre un bot칩n."
                },
                {
                    "id": "d2",
                    "title": "Animaciones con @keyframes",
                    "explicacion": "Con `@keyframes` puedes definir pasos de animaci칩n complejos y aplicarlos a elementos con `animation`."
                }
            ],
            "video": "",
            "dato": "Las animaciones CSS mejoran la interactividad sin necesidad de JavaScript."
        },
        {
            "id": 5,
            "title": "Buenas pr치cticas y accesibilidad",
            "description": "Optimiza tu c칩digo CSS, mejora la experiencia del usuario y la accesibilidad de tu web.",
            "lecciones": [
                {
                    "id": "e1",
                    "title": "Organizaci칩n de CSS",
                    "explicacion": "Mantener un CSS modular, usando archivos separados y comentarios claros, facilita mantenimiento y escalabilidad."
                },
                {
                    "id": "e2",
                    "title": "Accesibilidad y contraste",
                    "explicacion": "Usar colores con buen contraste, tipograf칤as legibles y evitar animaciones excesivas mejora la accesibilidad."
                },
                {
                    "id": "e3",
                    "title": "Optimizaci칩n y rendimiento",
                    "explicacion": "Minificar archivos, reducir selectores innecesarios y usar CSS moderno evita sobrecargar la web y mejora tiempos de carga."
                }
            ],
            "video": "",
            "dato": "Un CSS limpio, eficiente y accesible potencia tanto la est칠tica como la funcionalidad de tu sitio."
        }
    ]
}
